In [3]:
#Selección de datos de un dataframe con una condición
import pandas as pd

In [4]:
rows = "ventas1 ventas2 ventas3".split()
rows

['ventas1', 'ventas2', 'ventas3']

In [5]:
columns = "zonaA zonaB zonaC".split()
columns

['zonaA', 'zonaB', 'zonaC']

In [6]:
data = [[120,32,190], [190, 289, 901], [179, 129, 400]]
data

[[120, 32, 190], [190, 289, 901], [179, 129, 400]]

In [7]:
dataframe = pd.DataFrame(data, rows, columns)
dataframe

         zonaA  zonaB  zonaC
ventas1    120     32    190
ventas2    190    289    901
ventas3    179    129    400

In [8]:
row_condition = dataframe > 200
dataframe[row_condition]

         zonaA  zonaB  zonaC
ventas1    NaN    NaN    NaN
ventas2    NaN  289.0  901.0
ventas3    NaN    NaN  400.0

In [15]:
column_condition = dataframe["zonaA"] > 150
dataframe[column_condition]

         zonaA  zonaB  zonaC
ventas2    190    289    901
ventas3    179    129    400

In [23]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120     32    190
ventas2    190    289    901
ventas3    179    129    400

In [41]:
double_condition = (dataframe["zonaA"] > 145) | (dataframe["zonaB"] > 200)
dataframe[double_condition]

         zonaA  zonaB  zonaC
ventas2    190    289    901
ventas3    179    129    400

In [50]:
dataframe[double_condition]["zonaB"]

ventas2    289
ventas3    129
Name: zonaB, dtype: int64

In [56]:
dataframe[double_condition][["zonaB", "zonaC"]]

         zonaB  zonaC
ventas2    289    901
ventas3    129    400